       IDENTIFICATION DIVISION.
           PROGRAM-ID. TEST-COPY.
      *
       ENVIRONMENT DIVISION.
      *
       DATA DIVISION.
      *
       WORKING-STORAGE SECTION.
      *
       COPY TEST31.CPY
      *
       PROCEDURE DIVISION.
      *
           DISPLAY "TEST COPY KEYWORD".
           DISPLAY T1-FLD1.
           DISPLAY T1-FLD2.
